Fan/ddsl.html
---
layout: index
title:  A brief category of domain specific languages
---


<p>
According to wiki:
</p>
<blockquote>
<p>
A domain-specific language (DSL) is a type of programming language or specification language in software development and domain engineering dedicated to a particular problem domain, a particular problem representation technique, and/or a particular solution technique.
</p>
</blockquote>

<p>
There are mainly three kinds of DSLs <i>e.g.</i>, embeded DSL, external
DSL and delimited DSL.
</p>
<ol class="org-ol">
<li><a href="http://www.haskell.org/haskellwiki/Embedded_domain_specific_language">Embeded DSL</a> are essentially normal functions,
its functionality is inherently limited, due to lacking staging,
program analysis and optimization, yet it's easy to implement in some
expressive languages.
</li>
<li>External DSL are real languages targeted at a small domain, like
other full blown programming languages, <i>i.e.</i> C, C++, it may
include the whole pipeline of the compiler, from the front-end
to back-end. It's more powerful compared with embeded DSL, yet
much more difficult to build an efficient compiler, and more
importantly, it brings problem: language inter-operation.
</li>

<li>Delimited DSL. DDSL stands between embeded DSL and external DSL,
it needs a front-end and backend. Since its backend is the host
language, compared with external DSL, language inter-operation is
much easier, learning curve is relatively low.
</li>
</ol>

<p>
Fan advocates DDSL, it adopts OCaml as backend, all DDSLs are
compiled into OCaml, since OCaml is a highly portable langauge, which
means Fan is cross-platform for free.
</p>

<p>
Adopting a high-level language as backend is popular nowadays, some
famous examples includes: <a href="http://haxe.org/">Haxe</a>, <a href="http://en.wikipedia.org/wiki/Cfront">Cfront</a>, and numerous <a href="http://altjs.org/">javascript backends</a>.
</p>
